Res-container-set-v6/container_t_10_c_30_frontCore_8_wrkCore_1/wrk.txt
Running 1m test @ http://128.226.119.92:5000
  10 threads and 30 connections
  Thread calibration: mean lat.: 4701.744ms, rate sampling interval: 16293ms
  Thread calibration: mean lat.: 4739.845ms, rate sampling interval: 16744ms
  Thread calibration: mean lat.: 4729.677ms, rate sampling interval: 16719ms
  Thread calibration: mean lat.: 4725.007ms, rate sampling interval: 16891ms
  Thread calibration: mean lat.: 4724.161ms, rate sampling interval: 16990ms
  Thread calibration: mean lat.: 4680.235ms, rate sampling interval: 16875ms
  Thread calibration: mean lat.: 4639.597ms, rate sampling interval: 16744ms
  Thread calibration: mean lat.: 4764.364ms, rate sampling interval: 17055ms
  Thread calibration: mean lat.: 4689.187ms, rate sampling interval: 17039ms
  Thread calibration: mean lat.: 4744.615ms, rate sampling interval: 16891ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    22.50s     6.81s   45.19s    70.19%
    Req/Sec   821.90      8.07   837.00     71.43%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   21.69s 
 75.000%   26.54s 
 90.000%   30.47s 
 99.000%   45.19s 
 99.900%   48.04s 
 99.990%   48.46s 
 99.999%   48.66s 
100.000%   48.66s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    8269.823     0.000000            2         1.00
   13729.791     0.100000        41166         1.11
   17252.351     0.200000        82400         1.25
   19595.263     0.300000       123808         1.43
   20774.911     0.400000       165020         1.67
   21692.415     0.500000       206294         2.00
   22249.471     0.550000       226817         2.22
   23183.359     0.600000       246926         2.50
   24395.775     0.650000       267727         2.86
   25329.663     0.700000       288233         3.33
   26542.079     0.750000       308663         4.00
   27164.671     0.775000       318960         4.44
   27770.879     0.800000       329349         5.00
   28393.471     0.825000       339806         5.71
   28999.679     0.850000       349958         6.67
   29818.879     0.875000       360297         8.00
   30162.943     0.887500       365512         8.89
   30474.239     0.900000       370526        10.00
   30900.223     0.912500       375582        11.43
   31490.047     0.925000       380696        13.33
   32129.023     0.937500       385902        16.00
   32473.087     0.943750       388473        17.78
   32931.839     0.950000       391045        20.00
   33914.879     0.956250       393562        22.86
   35323.903     0.962500       396168        26.67
   36438.015     0.968750       398722        32.00
   37814.271     0.971875       399967        35.56
   39944.191     0.975000       401254        40.00
   41910.271     0.978125       402559        45.71
   42860.543     0.981250       403838        53.33
   43843.583     0.984375       405130        64.00
   44335.103     0.985938       405814        71.11
   44662.783     0.987500       406413        80.00
   45023.231     0.989062       407079        91.43
   45318.143     0.990625       407753       106.67
   45744.127     0.992188       408362       128.00
   46006.271     0.992969       408690       142.22
   46170.111     0.993750       408970       160.00
   46366.719     0.994531       409323       182.86
   46530.559     0.995313       409649       213.33
   46727.167     0.996094       409955       256.00
   46858.239     0.996484       410130       284.44
   46989.311     0.996875       410275       320.00
   47185.919     0.997266       410422       365.71
   47415.295     0.997656       410582       426.67
   47611.903     0.998047       410744       512.00
   47710.207     0.998242       410851       568.89
   47775.743     0.998437       410923       640.00
   47841.279     0.998633       410978       731.43
   47972.351     0.998828       411065       853.33
   48037.887     0.999023       411149      1024.00
   48070.655     0.999121       411194      1137.78
   48103.423     0.999219       411227      1280.00
   48136.191     0.999316       411272      1462.86
   48168.959     0.999414       411297      1706.67
   48234.495     0.999512       411365      2048.00
   48234.495     0.999561       411365      2275.56
   48267.263     0.999609       411401      2560.00
   48267.263     0.999658       411401      2925.71
   48300.031     0.999707       411422      3413.33
   48332.799     0.999756       411437      4096.00
   48365.567     0.999780       411454      4551.11
   48398.335     0.999805       411466      5120.00
   48398.335     0.999829       411466      5851.43
   48463.871     0.999854       411495      6826.67
   48463.871     0.999878       411495      8192.00
   48463.871     0.999890       411495      9102.22
   48463.871     0.999902       411495     10240.00
   48496.639     0.999915       411504     11702.86
   48529.407     0.999927       411514     13653.33
   48529.407     0.999939       411514     16384.00
   48529.407     0.999945       411514     18204.44
   48562.175     0.999951       411518     20480.00
   48562.175     0.999957       411518     23405.71
   48594.943     0.999963       411522     27306.67
   48627.711     0.999969       411529     32768.00
   48627.711     0.999973       411529     36408.89
   48627.711     0.999976       411529     40960.00
   48627.711     0.999979       411529     46811.43
   48627.711     0.999982       411529     54613.33
   48627.711     0.999985       411529     65536.00
   48660.479     0.999986       411535     72817.78
   48660.479     1.000000       411535          inf
#[Mean    =    22504.853, StdDeviation   =     6813.125]
#[Max     =    48627.712, Total count    =       411535]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  493281 requests in 1.00m, 203.82MB read
Requests/sec:   8222.57
Transfer/sec:      3.40MB